<UKN>
the
and
a
to
is
i
was
of
for
in
it
food
this
we
you
but
with
place
not
have
that
are
great
good
on
service
my
at
they
were
had
be
restaurant
very
so
go
as
there
if
all
been
like
here
from
one
best
an
our
out
get
would
it's
or
their
by
will
your
more
back
just
when
has
time
about
always
delicious
pizza
menu
don't
what
too
try
only
i've
even
than
dinner
some
never
wine
nice
can
well
which
up
no
really
staff
excellent
us
me
times
table
people
prices
wait
recommend
little
night
friendly
also
better
other
eat
who
went
thai
experience
restaurants
sushi
because
ever
atmosphere
most
while
new
again
worth
fresh
dishes
small
price
do
though
over
could
friends
love
special
indian
after
its
meal
first
nyc
bar
lunch
chicken
definitely
got
make
city
everything
ordered
much
order
drinks
can't
them
many
last
way
going
tasty
i'm
fish
say
he
two
around
wonderful
come
didn't
highly
places
attentive
made
am
want
amazing
bit
any
then
dish
being
hot
neighborhood
down
however
still
know
rice
bad
actually
quality
decor
how
visit
taste
cheese
perfect
spot
before
next
find
ny
authentic
york
nothing
came
years
portions
favorite
both
quite
side
seated
looking
away
sauce
spicy
pretty
romantic
take
ambience
once
area
off
tried
cheap
italian
friend
without
must
expensive
waiter
average
you're
list
dining
give
overall
dessert
group
big
large
where
enough
live
every
sure
feel
disappointed
money
into
three
least
often
think
french
minutes
date
street
lot
yet
since
fast
family
such
far
different
fine
should
reviews
full
eating
left
cuisine
another
fantastic
appetizer
few
fun
ambiance
his
enjoy
bagels
took
check
sit
selection
reasonable
look
salad
course
may
right
less
reservation
late
recommended
rolls
wasn't
same
see
found
those
usually
eaten
you'll
warm
makes
town
glass
huge
return
tuna
decent
outside
deal
ok
bagel
thought
cold
regular
east
asked
fried
specials
bring
thing
crowded
high
that's
chef
ate
husband
beef
work
dim
sum
enjoyed
appetizers
did
value
steak
cool
leave
felt
coming
room
served
keep
slow
each
now
week
priced
village
kind
house
top
sometimes
everyone
roll
anything
waitress
tables
especially
expect
bread
home
st
hour
delivery
evening
cute
world
reservations
impressed
chinese
wrong
music
rude
soup
finally
chinatown
bill
main
loud
saturday
shrimp
drink
anyone
outstanding
plate
isn't
birthday
although
twice
ask
almost
sake
else
during
sandwich
pay
need
part
couple
dumplings
arrived
loved
horrible
overpriced
waiters
terrific
cooked
they're
liked
whole
owner
sat
choices
manhattan
pricey
beer
day
entire
used
bland
seating
there's
salmon
manager
door
rather
pad
th
water
either
something
pm
probably
simple
beautiful
wife
seafood
won't
curry
why
japanese
cannot
told
call
having
above
half
ingredients
incredible
seems
cozy
prompt
noodles
empty
old
review
lobster
happy
tiny
line
quick
please
chance
her
busy
she
pasta
worst
chocolate
truly
slightly
trip
absolutely
boyfriend
flavor
wouldn't
simply
desserts
several
entree
lamb
real
sweet
close
prepared
extremely
upper
sitting
trying
upon
second
ago
pleasant
point
feeling
done
packed
inside
someone
garlic
block
problem
person
open
fact
said
lived
yourself
portion
walk
bistro
conversation
party
rest
anywhere
location
i'd
yummy
couldn't
affordable
soon
consistently
variety
helpful
treated
understand
terrible
bottle
past
quiet
sea
things
getting
saw
bartender
forget
despite
business
until
save
life
green
does
looked
gem
these
spectacular
casual
long
interesting
slice
mind
called
kitchen
itself
reason
run
style
super
joint
doesn't
satisfied
end
except
dine
own
fabulous
wanted
size
opened
garden
dry
name
myself
oh
cafe
sichuan
instead
across
space
gets
offers
salads
might
piece
noise
pork
deli
certainly
expected
spice
tasted
surprise
ordering
stay
pastrami
dark
waitstaff
unique
stuff
soggy
reasonably
share
cost
complimentary
we've
seen
completely
black
visited
making
girlfriend
inexpensive
poor
ive
filled
limited
entrees
hungry
jazz
guests
extra
customer
secret
server
hostess
fare
wish
duck
amount
four
wines
yes
comfortable
red
suan
bite
considering
foods
la
cramped
avenue
white
pleasantly
surprised
glasses
servers
comes
offer
brunch
mouth
nights
care
mean
plus
read
idea
incredibly
view
awesome
matter
vegetables
typical
able
kids
outdoor
oil
gave
pieces
spent
traditional
stumbled
beat
let
knew
hang
become
weekends
glad
started
maybe
soft
crab
month
use
crust
tastes
girls
says
customers
smile
true
early
occasion
delivered
sashimi
plain
crowd
tell
seem
literally
seat
including
popular
park
prix
fixe
quickly
believe
tip
meat
scene
doubt
type
selections
show
skip
they've
front
doing
owners
ended
lucky
fusion
touch
cream
summer
shows
square
put
walked
mediocre
sunday
extensive
tasting
whether
thin
ice
vibe
miss
anniversary
free
disappointing
ave
stomach
setting
rushed
taiwanese
months
brooklyn
brought
american
plenty
cake
mention
establishment
relaxed
jimmy's
unless
tuk
awful
promptly
nearby
together
grand
relax
walking
dont
afternoon
items
head
okay
choice
beers
recently
midtown
year
based
corner
lack
previous
accomodating
friday
watching
personal
lovely
looks
received
per
rush
along
blue
low
particularly
noisy
available
through
sense
reading
orsay
hard
delight
offered
treat
stop
start
guys
compared
moment
sandwiches
mushroom
thank
hands
west
hand
sharing
vegetarian
modern
between
speak
fan
serve
tea
fair
split
noticed
vietnamese
forgot
below
talk
besides
interior
roth's
quantity
visiting
enjoying
wow
happened
guess
heartland
write
hate
amazed
grilled
perhaps
somewhere
rao's
hadn't
die
consider
baby
pizzas
living
waiting
classic
crispy
fancy
forward
joints
eye
oily
among
five
smaller
weren't
clean
beyond
counter
sides
change
filling
case
experienced
you've
annoying
filet
turned
middle
later
avoid
paris
shanghai
joya
favorites
solid
agree
reviewer
you'd
suggest
katz's
spend
tamarind
taj
greatest
presented
naan
kai
ravioli
presentation
surprisingly
ignored
certain
burger
unlike
salty
asian
light
attitude
decided
management
sort
mizu
corned
eats
plan
others
buns
him
range
impress
addition
lousy
stick
relaxing
fries
disappointment
tomato
basil
sizes
lots
given
saul
smith
pick
noodle
mushrooms
job
hall
works
fix
toppings
growing
everytime
morning
various
located
jekyll
hyde
dined
caviar
taken
waste
serving
flavors
comfort
easily
similar
barely
opinion
yeah
buffet
pizzeria
exceptional
toast
help
folks
pie
lime
downtown
returning
steakhouse
celebrate
courses
include
mussels
toons
finish
offering
hear
odd
dosa
martini
unfortunately
willing
sapphire
brewery
efficient
co-workers
gotten
queens
biggest
i'll
checked
rare
congee
artisanal
trouble
regularly
kept
raw
crappy
bass
knows
throw
shredded
taking
vacation
missed
cash
pathetic
values
comparison
haru's
charge
calamari
sister
mix
tempura
eggplant
effort
takeout
amma
tiramisu
needs
tender
sangria
gone
experiences
set
traffic
families
running
enjoyable
host
intimate
young
cooking
eggs
item
written
complete
joe's
melted
roast
ginger
overbearing
problems
tend
level
weekend
mahal
subpar
employees
nd
paid
tikka
surprising
homemade
scores
further
pastas
so-so
larger
nearly
thinking
otherwise
lox
ues
champagne
phenomenal
nite
volare
thoroughly
soho
known
impressive
higher
bringing
heard
phone
tasteless
takes
behind
serves
he's
remember
consistent
groups
plates
imagine
option
recent
scallops
aside
twenty
longer
dressed
lemon
olive
they'd
website
rating
perfection
bucks
add
fondue
bank
entertainment
choose
changed
possible
section
means
alot
pub
basic
usual
relatively
delicate
cod
chips
salt
pepper
pot
girlfriends
hours
easy
par
alain
rate
guy
terms
waited
awsome
jersey
exotic
dress
lives
totally
under
seemed
tuesday
grab
professional
figured
sleek
wallet
seriously
spinach
oysters
poorly
tanks
freshness
strike
attractive
diverse
memorable
fatty
superb
frequently
goes
hidden
meats
mary's
bought
overwhelmed
obviously
seats
uncomfortable
wall
pickles
hold
strip
chart
original
floor
lovers
goat
au
poivre
toaster
mom's
ourselves
grew
buds
bored
spreads
bargain
bukhara
terrace
catch
ones
accurate
rudely
pre-theater
shell
soups
hope
likely
dollars
orders
bronx
bbq
enter
murray's
important
heavy
ordinary
funky
star
peep
suggestions
famous
mess
compare
craving
desired
club
included
types
attention
recommendation
planet
trendy
office
overrated
regardless
disapointed
guest
pudding
advice
impeccable
ess-a-bagel
trained
drive
kick
mignon
till
theater
comparable
bo
bart's
meeting
students
stands
mcdonald's
costs
turn
pink
del
frisco's
favor
dogs
impossible
positive
thanks
became
baluchi's
promised
saving
putting
blocks
river
williamsburg
ceiling
overly
combination
himself
vs
features
deserves
lazy
hit
complained
nicest
esp
repeat
food's
turns
s
creative
already
greeting
expecting
seasoning
assortment
immediately
diner
veal
oven
drop
happens
claimed
ride
searching
weather
definately
nonsense
sweetness
weeks
ping's
hurry
anyway
dollar
tokyo
egg
pre-theatre
forever
working
heaven
slices
rd
number
worked
turnover
frites
feat
quarters
beginning
magnificent
provided
tho
elsewhere
inedible
squid
oz
woman
freshest
moved
tomatoes
kinda
ruby
haven't
reality
event
hearty
careful
bombay
greeted
bother
break
rushing
combinations
refills
unlimited
platter
hurt
yorkers
lady
gives
noir
watery
lacking
sent
sauces
plentiful
opening
occassion
amazingly
gf
ino
indeed
elegant
citysearch
disgusting
chongqing
requests
delightful
balance
returned
friend's
shabu-shabu
meals
sorry
due
pastis
general
italy
sliced
excuse
supposed
juice
fairly
total
haru
lanterna
minnow
complain
pita
waitresses
what's
bean
thursday
snobs
worse
japan
lacked
quaint
courteous
burnt
spiced
resturant
hype
window
english
central
spending
cook
hey
loves
dates
complaint
gelato
mamoun's
smooth
reputation
naples
practically
air
begin
neapolitan
lightly
hip
entered
appears
stars
actors
potatoes
butter
alone
dumpling
ballato's
out-of-towners
potato
upstairs
tofu
gnochi
women
delightfully
etc
buy
wants
showed
nosh
